app/views/topics/new.html.erb

SELECT "communities".* FROM "communities" ORDER BY "communities"."name" ASC
---
  <p>
    <%= form.collection_select :community_id, Community.order(:name), :id, :name, { prompt: t('.select') } %>