app/controllers/communities_controller.rb

  def create
    @community = Community.new(community_params)

    if @community.save
---
INSERT INTO "communities" ("name", "description", "created_at", "updated_at") VALUES ('sdjfdfa', 'kfsjafkdsfsdk', '2025-08-06 12:21:21.552392', '2025-08-06 12:21:21.552392') RETURNING "id"

  def show
    @community = Community.find_by_id(params[:id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 3 LIMIT 1