app/controllers/topics_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id


    if @post
      @topic = Topic.new(topic_params)
      @topic.post = @post
      if @topic
        redirect_to @post
        else
          render :new
        end
      else
        @topic.save
---
INSERT INTO "posts" ("title", "community_id", "created_at", "updated_at", "user_id", "slug") VALUES ('sdfa', 4, '2025-10-09 07:49:33.752807', '2025-10-09 07:49:33.752807', 4, 'sdfa') RETURNING "id"
INSERT INTO "topics" ("text", "post_id", "created_at", "updated_at") VALUES ('asdfsad', 1, '2025-10-09 07:49:33.788235', '2025-10-09 07:49:33.788235') RETURNING "id"